append juz nie działa - działało jak w listach - do obiektu, na którym się wykonuje dodaje dodatkowe dane

Jeżeli jakaś kolumna nie istaniała w oryginalnym pliku, dodaje dodatkowe kolumny z NaN dla bioru oryginalnego

append skleja kolumny wspólne

ignore_index = True - kondynuuje index z 1szego pliku

**UNION w SQL nie dodaje nowych kolumn - wystarczy ta sama ilość (no i union nie dodaje dupliaktów - ALL)**

concat działa podobnie tylko można podać więcej plików - w celu inplacea trzeba przypisać do pierwszego podanego elementu

sort = True sortuje kolumne nie należącą do 1szego pliku w kolejność wszystkich kolumn (nie odstaje na końcu)

**ciekawa właściwość - po wyszukaniu df.loc[df.index == nr] mimo nowego indexu wyświetlają sie wiersz, które przed złączniem mmiały dany nr indexu - df[df.index == nr] działa poprawnie**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math

%matplotlib inline

In [2]:
mrbean = pd.read_csv(r'../course-files/mrbean_facebook_statuses_join.csv',
                     usecols=['status_message_mrbean','status_type','num_likes'])
mrbean.head()

                               status_message_mrbean status_type  num_likes
0  It's time for Mr Bean and Teddy to get ready f...       video      16079
1                                                NaN       photo     114008
2                                                NaN       photo     218579
3  Mr Bean is ready to do some shopping but bewar...       video      20338
4                                                NaN       photo     215591

In [11]:
nasa = pd.read_csv(r'../course-files/nasa_facebook_statuses_join.csv',
                  usecols=['status_message_nasa','status_type','num_likes'])
nasa.head()

                                 status_message_nasa status_type  num_likes
0  This morning, the #RockOn mission with student...       photo       5142
1  Pluto's largest moon, Charon, is home to an un...       photo      19074
2  Our Restore-L mission is an endeavor to launch...       photo       7551
3  A new dark vortex was discovered in the atmosp...       photo      24359
4                                                NaN       video       2731

In [16]:
fb = pd.concat([mrbean, nasa], sort=True)
fb.head()

,num_likes,status_message_mrbean,status_message_nasa,status_type
0,16079,It's time for Mr Bean and Teddy to get ready f...,NaN,video
1,114008,NaN,NaN,photo
2,218579,NaN,NaN,photo
3,20338,Mr Bean is ready to do some shopping but bewar...,NaN,video
4,215591,NaN,NaN,photo

In [5]:
fb.tail()

,num_likes,status_message_mrbean,status_message_nasa,status_type
758,39355,NaN,You've never seen Pluto like this before! New ...,photo
759,11835,NaN,Our cooperative field study in East Asia advan...,photo
760,15567,NaN,"After spending a #YearInSpace, astronaut Scott...",photo
761,41584,NaN,"Gravitational waves, predicted by Einstein and...",photo
762,12793,NaN,Have you ever used a GPS to help you get somew...,photo

In [17]:
fb.loc[0]

,num_likes,status_message_mrbean,status_message_nasa,status_type
0,16079,It's time for Mr Bean and Teddy to get ready f...,NaN,video
0,5142,NaN,"This morning, the #RockOn mission with student...",photo

In [13]:
fb1 = pd.concat([mrbean, nasa], sort=True, ignore_index=True)

In [19]:
fb1.loc[0]

num_likes                                                            16079
status_message_mrbean    It's time for Mr Bean and Teddy to get ready f...
status_message_nasa                                                    NaN
status_type                                                          video
Name: 0, dtype: object

In [21]:
fb1.loc[fb.index == 0]

,num_likes,status_message_mrbean,status_message_nasa,status_type
0,16079,It's time for Mr Bean and Teddy to get ready f...,NaN,video
56,5142,NaN,"This morning, the #RockOn mission with student...",photo

In [22]:
fb1[fb1.index == 0]

,num_likes,status_message_mrbean,status_message_nasa,status_type
0,16079,It's time for Mr Bean and Teddy to get ready f...,NaN,video

In [25]:
mrbean.rename(columns={'status_message_mrbean':'status_message'}, inplace=True)

In [26]:
nasa.rename(columns={'status_message_nasa':'status_message'}, inplace=True)

In [27]:
fb2 = pd.concat([mrbean, nasa])
fb2.head()

                                      status_message status_type  num_likes
0  It's time for Mr Bean and Teddy to get ready f...       video      16079
1                                                NaN       photo     114008
2                                                NaN       photo     218579
3  Mr Bean is ready to do some shopping but bewar...       video      20338
4                                                NaN       photo     215591